constantAngleSlopeDNS_U4e-1_A5_H1e-2_NotDNS/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	leftInletWall
	{
//		type			timeVaryingMappedFixedValue;
        type            fixedValue;
		value			uniform (0.4 0 0);
	}
	leftWall
	{
//		type			noSlip;
		type			pressureInletOutletVelocity;
		value			uniform (0 0 0);
	}
	rightWall
	{
		type			inletOutlet;
		inletValue		uniform (0 0 0);
	}
	lowerWall
	{
		type			noSlip;
	}
	atmosphere
	{
//		type			zeroGradient;
		type			pressureInletOutletVelocity;
		value			uniform (0 0 0);
	}
	sides
	{
		type			noSlip;
	}
	defaultFaces
	{
		type			empty;
	}
}


// ************************************************************************* //
