constantAngleSlopeDNS_U4e-1_A5_H1e-2_NotDNS/Allrun
#!/bin/sh
#cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication setFields
#runApplication $(getApplication)
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar
python3 prepareDNSData.py > log.python

#------------------------------------------------------------------------------
