constantAngleSlopeDNS_U4e-1_A5_H1e-2_NotDNS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0   0 0  )
    (10  0 0  )
    (10  2 0  )
    (0   2 0  )
    (0   0 10 )
    (10  0 10 )
    (10  2 10 )
    (0   2 10 )
    (0   0 11 )
    (10  0 11 )
    (10  2 11 )
    (0   2 11 )
);

blocks
(
 	//original with solving the smallest eddies
    //hex (0 1 2 3 4 5 6 7)   (17850 60 595)  simpleGrading (1 1 1)
    //hex (4 5 6 7 8 9 10 11) (17850 60 1190) simpleGrading (1 1 1)
 	//test one
    //hex (0 1 2 3 4 5 6 7)   (2500 50 250)  simpleGrading (1 1 1)
    //hex (4 5 6 7 8 9 10 11) (2500 50  25) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7)   (100 20 100)  simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (100 20  10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftInletWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    leftWall
    {
        //type wall;
        type patch;
        faces
        (
            (4 8 11 7)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
			(5 6 10 9)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (3 2 1 0)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }
	sides
	{
		type wall;
		faces
		(
			(0 1 5 4)
			(4 5 9 8)
			(7 6 2 3)
			(11 10 6 7)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
